<?xml version="1.0" ?>
<net name="model" version="10">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 384, 384"/>
			<output>
				<port id="0" names="image_input:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1485223014" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="1485822513" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_pad/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="Conv_pad/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="Conv_pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="Conv_pad/Pad:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>385</dim>
					<dim>385</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="68" shape="16, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" names="Conv/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>385</dim>
					<dim>385</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="1796" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="Conv/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="activation/activation/mul" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation/activation/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="activation/multiply/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" names="activation/multiply/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="1486422957" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1487022570" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="expanded_conv/depthwise/pad/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="expanded_conv/depthwise/pad/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="expanded_conv/depthwise/pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="expanded_conv/depthwise/pad/Pad:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>193</dim>
					<dim>193</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="expanded_conv/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="1860" shape="16, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="expanded_conv/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="expanded_conv/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>193</dim>
					<dim>193</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="expanded_conv/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="2436" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="expanded_conv/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="expanded_conv/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="expanded_conv/squeeze_excite/AvgPool/MeanGather1695622921" type="Const" version="opset1">
			<data element_type="i64" offset="2500" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="expanded_conv/squeeze_excite/AvgPool/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/AvgPool/Mean:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="reshape/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reshape/Shape:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="reshape/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="2516" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="reshape/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="2524" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="reshape/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="2524" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="reshape/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="reshape/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="29" name="reshape/Reshape/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="2516" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="reshape/Reshape/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="reshape/Reshape/shape/Unsqueeze1504" type="Const" version="opset1">
			<data element_type="i32" offset="2532" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="reshape/Reshape/shape/Unsqueeze1506" type="Const" version="opset1">
			<data element_type="i32" offset="2532" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="reshape/Reshape/shape/Unsqueeze1508" type="Const" version="opset1">
			<data element_type="i32" offset="2536" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="reshape/Reshape/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="reshape/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reshape/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="reshape/Reshape/Transpose/value1404723062" type="Const" version="opset1">
			<data element_type="i64" offset="2540" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="reshape/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="reshape/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2572" shape="8, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="expanded_conv/squeeze_excite/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3084" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="expanded_conv/squeeze_excite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="expanded_conv/squeeze_excite/Relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="expanded_conv/squeeze_excite/Relu/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3116" shape="16, 8, 1, 1" size="512"/>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="expanded_conv/squeeze_excite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv_1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3628" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv_1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="activation_2/mul" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_2/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="expanded_conv/squeeze_excite/Mul/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Mul/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="expanded_conv/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="3692" shape="16, 16, 1, 1" size="1024"/>
			<output>
				<port id="0" names="expanded_conv/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="expanded_conv/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="4716" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="expanded_conv/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="expanded_conv/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="expanded_conv_1/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="4780" shape="72, 16, 1, 1" size="4608"/>
			<output>
				<port id="0" names="expanded_conv_1/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="expanded_conv_1/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="9388" shape="1, 72, 1, 1" size="288"/>
			<output>
				<port id="0" names="expanded_conv_1/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="expanded_conv_1/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="1487622819" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="1488222798" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="expanded_conv_1/depthwise/pad/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="expanded_conv_1/depthwise/pad/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="63" name="expanded_conv_1/depthwise/pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="expanded_conv_1/depthwise/pad/Pad:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>97</dim>
					<dim>97</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="9676" shape="72, 1, 1, 3, 3" size="2592"/>
			<output>
				<port id="0" names="expanded_conv_1/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="expanded_conv_1/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>97</dim>
					<dim>97</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="12268" shape="1, 72, 1, 1" size="288"/>
			<output>
				<port id="0" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="activation_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_4/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="expanded_conv_1/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="12556" shape="24, 72, 1, 1" size="6912"/>
			<output>
				<port id="0" names="expanded_conv_1/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="expanded_conv_1/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="expanded_conv_1/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="19468" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" names="expanded_conv_1/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="expanded_conv_1/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="expanded_conv_2/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="19564" shape="88, 24, 1, 1" size="8448"/>
			<output>
				<port id="0" names="expanded_conv_2/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="expanded_conv_2/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="expanded_conv_2/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="28012" shape="1, 88, 1, 1" size="352"/>
			<output>
				<port id="0" names="expanded_conv_2/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="expanded_conv_2/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="activation_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="28364" shape="88, 1, 1, 3, 3" size="3168"/>
			<output>
				<port id="0" names="expanded_conv_2/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="expanded_conv_2/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="31532" shape="1, 88, 1, 1" size="352"/>
			<output>
				<port id="0" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="activation_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_6/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="expanded_conv_2/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="31884" shape="24, 88, 1, 1" size="8448"/>
			<output>
				<port id="0" names="expanded_conv_2/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="expanded_conv_2/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="expanded_conv_2/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="40332" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" names="expanded_conv_2/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="expanded_conv_2/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="expanded_conv_2/Add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/Add/add:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="expanded_conv_3/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="40428" shape="96, 24, 1, 1" size="9216"/>
			<output>
				<port id="0" names="expanded_conv_3/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="expanded_conv_3/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="expanded_conv_3/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="49644" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" names="expanded_conv_3/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="expanded_conv_3/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="activation_7/activation_1/mul" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_7/activation_1/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="activation_7/multiply_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" names="activation_7/multiply_1/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="1488822582" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1489422510" type="Const" version="opset1">
			<data element_type="i64" offset="50028" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="expanded_conv_3/depthwise/pad/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="expanded_conv_3/depthwise/pad/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="expanded_conv_3/depthwise/pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" names="expanded_conv_3/depthwise/pad/Pad:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>51</dim>
					<dim>51</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="50060" shape="96, 1, 1, 5, 5" size="9600"/>
			<output>
				<port id="0" names="expanded_conv_3/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="expanded_conv_3/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>51</dim>
					<dim>51</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="59660" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="activation_8/activation_2/mul" type="HSigmoid" version="opset5">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_8/activation_2/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="activation_8/multiply_2/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="expanded_conv_3/squeeze_excite/AvgPool/MeanGather1697622567" type="Const" version="opset1">
			<data element_type="i64" offset="2500" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="expanded_conv_3/squeeze_excite/AvgPool/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/squeeze_excite/AvgPool/Mean:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="reshape_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reshape_1/Shape:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="reshape_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="2516" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape_1/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="reshape_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="2524" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape_1/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="reshape_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="2524" shape="1" size="8"/>
			<output>
				<port id="0" names="reshape_1/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="reshape_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="reshape_1/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="112" name="reshape_1/Reshape/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="2516" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
